# ThermalMaterialParamReflectivity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamReflectivity Property
ParameterTypeId Class See Also
---
"Reflectivity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamReflectivity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamReflectivity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamReflectivity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace